## Pandas

1. Libaray which facilitates Data analytics and related tools.
2. Manipiulates data with the help of series and dataframes

In [3]:
#Installing pandas
!pip install pandas

Requirement already satisfied: pandas in ./opt/anaconda3/lib/python3.9/site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in ./opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in ./opt/anaconda3/lib/python3.9/site-packages (from pandas) (2022.7.1)
Requirement already satisfied: numpy>=1.18.5 in ./opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in ./opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [4]:
#Importing package
import pandas as pd

In [6]:
print(pd.__version__)

1.4.4

### Series

In [7]:
list=[1,2,3,4,5]
list

[1, 2, 3, 4, 5]

In [8]:
#Converting list to series data structure
ser=pd.Series(list)
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

Difference between series and numpy array

   array -> fixed indexes, < 500k rows
   Series -> indexes can be changed, > 500k rows

In [11]:
list2=[1,2,3,4,5]
label=['a','b','c','d','e']

In [13]:
#Defining custom indexes 
ser2=pd.Series(list,index=label)
ser2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
#For dictionary, the indexes are taken as key values.
marks={"maths":43,"science":80,"physics":46,"chemistry":95}
marks

{'maths': 43, 'science': 80, 'physics': 46, 'chemistry': 95}

In [15]:
ser3=pd.Series(marks)
ser3

maths        43
science      80
physics      46
chemistry    95
dtype: int64

In [17]:
#Acessing only specific keys
ser4=pd.Series(marks,index=["maths","science","physics"])
ser4

maths      43
science    80
physics    46
dtype: int64

#### Series indexing

-> To access specific values from series

In [18]:
#Using index
ser3[1]

80

In [19]:
#Using key value
ser3["physics"]

46

In [21]:
#Slicing
ser3[1:3]

science    80
physics    46
dtype: int64

---------------------------------------------------------------------

In [24]:
#Checking shape
ser.shape

(5,)

In [25]:
#Checking type
type(ser3)

pandas.core.series.Series

### Dataframe

In [31]:
#Defining list and col and row indices.
list=[[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]
list
colums=["a","b","c","d"]
rows=["A","B","C","D"]

In [32]:
#Defining df with the help of list
df=pd.DataFrame(list,index=rows,columns=colums)
df

    a   b   c   d
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [67]:
df2=pd.DataFrame({"name":["vishwa","saanvi","chetan","priya"],"age":[2,5,10,15],"branch":["AI","ML","ECE","EEE"]})
df2

     name  age branch
0  vishwa    2     AI
1  saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [37]:
#Checking type
type(df2)

pandas.core.frame.DataFrame

In [36]:
#Checking shape
df2.shape

(4, 3)

In [48]:
#Checking columns
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [49]:
# Rename columns
df1=df2.rename(columns={"Name":"Nam"})
df1

     name  age branch
0  vishwa    2     AI
1  saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [51]:
#Grabbing speicfic values
df2.columns.values[0]

'name'

In [53]:
#Another way to rename
df2.columns.values[0]='Name'
df2

     Name  age branch
0  vishwa    2     AI
1  saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [68]:
#Dropping column (axis =1 -> col, axis=0 -> row, inplace -> commits changes)
df2.drop("name",axis=1,inplace=True)

In [69]:
df2

   age branch
0    2     AI
1    5     ML
2   10    ECE
3   15    EEE

In [71]:
#Adding a column
df2["place"]=["hyd","vellore","chennai","bangalore"]

In [72]:
df2

   age branch      place
0    2     AI        hyd
1    5     ML    vellore
2   10    ECE    chennai
3   15    EEE  bangalore

In [75]:
df3=pd.DataFrame({"name":["vishwa","saanvi","chetan","priya"],"age":[2,5,10,15],"branch":["AI","ML","ECE","EEE"]})
df3

     name  age branch
0  vishwa    2     AI
1  saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [76]:
df4=pd.DataFrame({"name":["a","b","c","d"],"age":[2,5,10,15],"branch":["AI","ML","ECE","EEE"],"place":["hyd","vellore","chennai","bangalore"]})
df4

  name  age branch      place
0    a    2     AI        hyd
1    b    5     ML    vellore
2    c   10    ECE    chennai
3    d   15    EEE  bangalore

In [77]:
#Contatenate two dfs
df5=df3.append(df4)
df5

/var/folders/ql/xm78crnd19l9q048s8b3qcv00000gn/T/ipykernel_57930/744755649.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df5=df3.append(df4)

     name  age branch      place
0  vishwa    2     AI        NaN
1  saanvi    5     ML        NaN
2  chetan   10    ECE        NaN
3   priya   15    EEE        NaN
0       a    2     AI        hyd
1       b    5     ML    vellore
2       c   10    ECE    chennai
3       d   15    EEE  bangalore

Clearly, the indexes are not right above. We need to ignore the index while merging.

In [79]:
#Fixing indices
df6=df3.append(df4,ignore_index="True")
df6

/var/folders/ql/xm78crnd19l9q048s8b3qcv00000gn/T/ipykernel_57930/3742184186.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df6=df3.append(df4,ignore_index="True")

     name  age branch      place
0  vishwa    2     AI        NaN
1  saanvi    5     ML        NaN
2  chetan   10    ECE        NaN
3   priya   15    EEE        NaN
4       a    2     AI        hyd
5       b    5     ML    vellore
6       c   10    ECE    chennai
7       d   15    EEE  bangalore

#### Handling null values

1. Deleting rows, column -> When less data is null
2. Impuing the values -> When large data is null

In [81]:
import numpy as np
df7=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df7

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [82]:
#Checking for null values
df7.isnull()

    Name  score1  score2
0  False   False    True
1   True   False   False
2  False    True   False
3   True    True    True
4  False   False   False
5  False   False   False

In [83]:
#Checking number of null values in a column
df7.isnull().sum()

Name      2
score1    2
score2    2
dtype: int64

In [86]:
# Deleting rows with null values
df7.dropna(inplace=True)

In [87]:
df7

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [88]:
import numpy as np
df7=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df7

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [90]:
# Deleting columns with null values
df7.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

Imputing the values

1 2 3 4 5 5

Mean -> 1+2+3+4+5+5/6
Median -> 3+4/2
Mode -> 5

In [94]:
#Imputing the values by filling null values with mean 
df7['score1']=df7['score1'].fillna(df7['score1'].mean())
df7

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [95]:
#Imputing the values by filling null values with median 
df7['score2']=df7['score2'].fillna(df7['score2'].median())
df7

      Name  score1  score2
0   tulasi     5.0     5.0
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [97]:
#Use mode wherever there are categorial values
#Mode function puts the highest frequency in 0 index, next in 1 index and so on.
df7['Name']=df7['Name'].fillna(df7['Name'].mode()[0]) 
df7

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [101]:
#Grouping by name and finding mean
group=df7.groupby("Name")
group

In [102]:
group.mean()

         score1  score2
Name
saanvi    4.375    4.75
supriya   4.500    9.00
tulasi    5.000    5.00

Acessing rows and cols

1. loc -> label indexing
2. iloc -> integer indexing

In [106]:
df7.loc[0:2]

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0

In [107]:
data={
    "calories":[420,125,154],
    "duration":[50,40,45]
}
data

{'calories': [420, 125, 154], 'duration': [50, 40, 45]}

In [108]:
df9=pd.DataFrame(data,index=["day1","day2","day3"])
df9

      calories  duration
day1       420        50
day2       125        40
day3       154        45

In [110]:
#grabbing content using labels
df9.loc["day2"]

calories    125
duration     40
Name: day2, dtype: int64

In [114]:
df9=pd.DataFrame({"name":["vishwa","saanvi","chetan","priya"],"age":[2,5,10,15],"branch":["AI","ML","ECE","EEE"]})
df9

     name  age branch
0  vishwa    2     AI
1  saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [116]:
#Grabbing content using indices.
df9.iloc[1:3,0:2]

     name  age
1  saanvi    5
2  chetan   10

In [117]:
df9.iloc[2:4,1:3]

   age branch
2   10    ECE
3   15    EEE

In [119]:
df9.iloc[3:,0:1]

    name
3  priya